Revit 2025 API
RebarBendData.HookAngle0 Property
 The angle of the hook at the start.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public int HookAngle0 { get; set; }
Public Property HookAngle0 As Integer
	Get
	Set
public:
property int HookAngle0 {
	int get ();
	void set (int value);
}
member HookAngle0 : int with get, set
Property Value
Int32
See Also
Reference
RebarBendData Class
Autodesk.Revit.DB.Structure Namespace